'''
Игра "Insanity"
При входе в игру, вы получите обучение в виде подсказок, которые покажут азы управления. Вас встречает лес, в котором
`расположены:
          - Лавка алхимика (в ней можно купить 2 зелья из 3 перед каждым уровнем (мана, здоровье, сила) )
          - Лавка мага (Изучение одного заклинания после каждого уровня)
          - Подземелье: сначала перед игроком появляются 5 дверей, 4 из них закрыты. После каждого уровня прошлая дверь становится
            недоступной, следующая открывается. После 4 пройденных дверей игрок покупает припасы у алхимика, изучает заклинание у
мага и при входе в подземелье вместо дверей появляется портал, который ведет на финальный уровень.
Система боя:
Взята из героев меча и магии
бои проходят пошагово. В свой ход игрок может передвинуть главного героя и атаковать врагов (на поле их 4-5).
Победа зависит от стратегии игрока и способностей героя, которые игрок изучил в лавке мага
'''